app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Mon, 09 Jul 2012 17:17:08 UTC +00:00], ["updated_at", Mon, 09 Jul 2012 17:17:08 UTC +00:00]]