app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY name LIMIT 1  [["id", "980190962"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Mon, 09 Jul 2012 17:23:20 UTC +00:00], ["updated_at", Mon, 09 Jul 2012 17:23:20 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cart_id", 980190964], ["created_at", Mon, 09 Jul 2012 20:06:00 UTC +00:00], ["order_id", nil], ["product_id", 980190962], ["quantity", 1], ["updated_at", Mon, 09 Jul 2012 20:06:00 UTC +00:00]]