app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    @orders = Order.paginate :page=>params[:page],:order => 'created_at desc', :per_page =>10

SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 980190966
---
  def new
    @cart = current_cart
    if @cart.line_items.empty?

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_method", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  @order = Order.new(params[:order])
  @order.add_line_items_from_cart(current_cart)
  respond_to do |format|
    if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", "980190962"]]
---
  def update
    @order = Order.find(params[:id])