app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY name

  def show
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY name LIMIT 1  [["id", "980190962"]]

  def edit
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY name LIMIT 1  [["id", "980190962"]]

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "name", "price", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY name LIMIT 1  [["id", "980190962"]]
UPDATE "products" SET "name" = 'Lorem Ipsum', "description" = 'Wibbles are fun', "image_url" = 'lorem.jpg', "price" = 10.0, "updated_at" = '2012-07-09 14:59:13.341042' WHERE "products"."id" = 980190962

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY name LIMIT 1  [["id", "980190962"]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 980190962]]