app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY name
---
  def index
    @products = Product.all